In [1]:
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, 7, 9])
print(s)

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [3]:
dic = {'a':1, 'b':2, 'c':3}
s = pd.Series(dic)
print(s)

a    1
b    2
c    3
dtype: int64

In [6]:
print(s.values)
print(s.index)

[1 2 3]
Index(['a', 'b', 'c'], dtype='object')

In [7]:
s = pd.Series([1,3,5,7,9], index=['LGT','DOO','HWE','LOT','SKW'])
print(s)

LGT    1
DOO    3
HWE    5
LOT    7
SKW    9
dtype: int64

In [8]:
score={'학번':[201524213,201621223,201621233],
       '이름':['오지환','박용택','정성훈'],
       'Quiz':[15,20,10],
       '중간고사':[20,20,15]}

score_df= pd.DataFrame(score)
score_df

          학번   이름  Quiz  중간고사
0  201524213  오지환    15    20
1  201621223  박용택    20    20
2  201621233  정성훈    10    15

In [12]:
print(type(score_df['학번']))
score_df['학번']

<class 'pandas.core.series.Series'>

0    201524213
1    201621223
2    201621233
Name: 학번, dtype: int64

In [18]:
print(type(score_df[['학번','이름']]))
score_df[['학번','이름']]

<class 'pandas.core.frame.DataFrame'>

          학번   이름
0  201524213  오지환
1  201621223  박용택
2  201621233  정성훈

In [20]:
s = pd.Series([201711023, '홍길동', 19, 19]), index = (['학번', '이름', 'Quiz', '중간고사'])
score_df = score_df.append(s, ignore_index=True)
score_df

SyntaxError: invalid syntax. Maybe you meant '==' or ':=' instead of '='? (1766821588.py, line 1)